Revit 2024 API
AssemblyViewUtils.CreateSingleCategorySchedule Method (Document, ElementId, ElementId)
 Creates a new single-category schedule assembly view for the assembly instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static ViewSchedule CreateSingleCategorySchedule(
	Document document,
	ElementId assemblyInstanceId,
	ElementId scheduleCategoryId
)
Visual Basic
Public Shared Function CreateSingleCategorySchedule ( _
	document As Document, _
	assemblyInstanceId As ElementId, _
	scheduleCategoryId As ElementId _
) As ViewSchedule
Visual C++
public:
static ViewSchedule^ CreateSingleCategorySchedule(
	Document^ document,
	ElementId^ assemblyInstanceId,
	ElementId^ scheduleCategoryId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document to which the view will be added.
assemblyInstanceId
Type: Autodesk.Revit.DB.ElementId
 Id of the assembly instance that owns the new view.
scheduleCategoryId
Type: Autodesk.Revit.DB.ElementId
 Id of the category for which the schedule will be created. Use ViewSchedule.IsValidCategoryForSchedule() to check if a category can be scheduled.
Return Value
 A new single-category schedule assembly view.
Remarks
 The new single-category schedule will be preloaded with fields "Family and Type" and "Count". The schedule will be empty if there are no elements of the specified category in the assembly instance. The document must be regenerated before using the schedule.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  assemblyInstanceId is not an AssemblyInstance. -or- scheduleCategoryId is not a valid category for a regular schedule.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
AssemblyViewUtils Class
CreateSingleCategorySchedule Overload
Autodesk.Revit.DB Namespace